{
  "README": "# Smart Memos v1.1\n\n![SmartMemos](assets/SmartMemo2.gif) \n\nWelcome to the Smart Memos! This plugin integrates seamlessly with your Obsidian, offering an advanced, interactive way to transcribe and generate notes from your audio files. My goal is to enhance your ability to capture and understand information from audio sources, transforming the way you interact with and understand your information.\n\n## Features\n- **Enhanced Audio Recorder**: Record audio files directly into an Obsidian note with added functionality to pause, resume, and restart recordings. \n- **Audio Transcription**: Transcribe audio files that are either spoken directly into Obsidian or imported into a note using advanced AI models.\n- **Note Generation**: Generate detailed notes in markdown language from the transcribed audio.\n- **Customizable Prompts**: Customize the prompt that will be sent to the AI model before adding your transcribed audio so you can get any kind of analysis, note structure format, or enhancements you want!\n- **Built in Obsidian Support**: Use the customized prompt to request formats that are supported by obsidian, such as markdown and mermaid charts as you can see in the video.\n- **Support for Multiple Audio Formats**: Supports mp3, mp4, mpeg, mpga, wav, webm audio formats.\n\n## Installation\nGetting started with the Smart Memos Plugin is easy. Follow these steps to install:\n\n1. Download and install the Smart Memos Plugin from the Obsidian Community Plugins.\n2. Configure the plugin settings with your OpenAI API Key and preferred AI model.\n\nNote* This plugin currently uses online openAI models to recieve and transcribe your voice memos.  Looking to add Local AI Models in the near future. OpenAI's retention policy retains text up to 30 days, but does not retain any audio data. \n\n## Platforms\n\n- Desktop\n- Mobile (iOS temporarily unavailable)\n\n## Usage\nOnce installed, the Smart Memos Plugin provides an intuitive interface to transcribe your audio files and generate notes.  \n\n- **Adding Audio**: To speak your memo directly into Obsidian, tap the microphone icon that displays \"Record smart memo\" or select `Record smart memo` from the command palette (`Ctrl + p` for Windows and `Cmd + p` for Mac) to open the smart memos popup that'll automatically start recording.  To import audio into a note, simply drag and drop an audio file into it.\n- **Transcribing Audio**: To transcribe an audio file after it's been imported into a note, move your cursor right underneath the audio file and use the command `Smart transcribe` from the command palette. The plugin will transcribe the audio file and generate detailed notes. If you're speaking directly to Obsidian, you can select the \"Smart Transcribe\" button to transcribe what you've recorded.\n- **Customizing the Prompt**: You can customize the prompt that will be sent to the AI model before adding your transcribed audio in the plugin settings.\n- **Include Raw Transcript**: If you just want clean notes returned, you can remove the addition of the raw transcript at the end by toggling it off in the settings\n\nNote* This plugin finds your audio file by looking at what you have set at the \"Default location for new attachments\" within the \"Files and Links\" tab of Obsidian settings.  If your audio file is for some reason not stored at the location specified, you should move it there.  I will see about a workaround for missplaced audio files.\n\n## Vision\nThe Smart Memos plugin aims to revolutionize the way we capture and understand information from audio sources. By leveraging advanced AI models, the plugin can transcribe audio files and generate fully customizable notes, in-depth analysis, and idea expansion, freeing you from the tedious task of manual transcription and note-taking, while simultaneously expanding upon them to allow your two \"brains\" to work harmoneously.\n\nThe ultimate mission is to enhance productivity, ideas, and efficiency in note-taking, especially for users who frequently deal with audio sources of information or find it much easier to simply speak whatever is on their mind than write it all down. With this plugin, I envision a future where valuable information from audio sources doesn't get lost and is automatically integrated into your own, personalized way of note-taking.\n\n## About Me\nHello there! Name's Evan 😁\n\nI'm a senior software developer/architect consultant, currently managing and developing data visualization tools for the CDC. I've been obsessed about what's transpiring with AI for the last 12-ish years, fully aware that it would soon completely change the world.\n\nInspired by Brian, the creator of Smart Connections, I started an AI consulting company called \"Evan's Oasis.\" At Evan's Oasis, I audit business workflows for clients and recommend AI tools and practices that significantly enhance decision-making, productivity, and quality—while reducing the time and money needed to run a business.\n\n## Community and Support\nYour involvement is crucial to the evolution of Smart Memos. From troubleshooting issues to suggesting new features, every contribution enriches our community and drives the project forward!\n\n- **Join The Community**\n  - GitHub Discussions: Participate in discussions on GitHub to share your experiences and ask questions.\n  - Contribute: Help develop the plugin, report issues, or suggest new features.\n  - User Testimonials: Share how the plugin has impacted your workflow and creativity.\n\n\n## License\nThe Smart Memos Plugin is open-source and available under the MIT License. Contributions are welcome!\n\nFeel free to reach out with any questions or suggestions. I hope this plugin enhances your note-taking experience and helps you uncover new insights and connections within your notes. Happy transcribing!\n",
  "smart-memos-settings": "<div class=\"smart-memos-settings\" id=\"smart-memos-settings\">\n  <h1>Smart Memos</h1>\n  <div class=\"setting-component\"\n    data-name=\"Text Generation Model Platform\"\n    data-setting=\"chat_model_platform_key\"\n    data-type=\"dropdown\"\n    data-description=\"Select a model platform to use with Smart Chat.\"\n    data-callback=\"changed_smart_chat_platform\"\n    <%- chat_platforms.map((platform, i) => `data-option-${i + 1}=\"${platform.key}|${platform.description}\"`).join('\\n') %>\n  ></div>\n  <% if(chat_platform?.fetch_models) { %>\n    <% if(settings[settings.chat_model_platform_key]?.api_key) { %>\n      <div class=\"setting-component\"\n        data-name=\"Model Name\"\n        data-type=\"dropdown\"\n        data-setting=\"<%= settings.chat_model_platform_key %>.model_name\"\n        <%- platform_chat_models.map((model, i) => `data-option-${i}=\"${model.key}|${model.model_name} (${model.description})\"`).join('\\n') %>\n      ></div>\n    <% } %>\n    <% if(!platform_chat_models.length) { %>\n      <div class=\"setting-component\"\n        data-name=\"Refresh Models List\"\n        data-type=\"button\"\n        data-callback=\"changed_smart_chat_platform\"\n      ></div>\n    <% } %>\n    <% if(!hasSmartConnections) { %>\n      <div class=\"setting-component\"\n      data-name=\"Import Model Config from Smart Connections\"\n      data-type=\"button\"\n      data-callback=\"import_model_config_from_smart_connections\"\n    ></div>\n    <% } %>\n    <div class=\"setting-component\"\n      data-name=\"<%= chat_platform.description %> API Key\"\n      data-type=\"text\"\n      data-setting=\"<%= settings.chat_model_platform_key %>.api_key\"\n      <% if(chat_platform.signup_url) { %>\n        data-description=\"<a href='<%= chat_platform.signup_url %>'>Get API Key</a> for <%= chat_platform.description %>.\"\n      <% } else { %>\n        data-description=\"API Key for <%= chat_platform.description %>.\"\n      <% } %>\n      data-placeholder=\"Enter an API Key\"\n      data-button=\"Save\"\n      data-callback=\"changed_smart_chat_platform\"\n    ></div>\n  <% } %>\n  <div class=\"setting-component\"\n    data-name=\"Custom transcription-to-notes prompt\"\n    data-type=\"textarea\"\n    data-setting=\"system_prompt\"\n  ></div>\n  <div class=\"setting-component\"\n    data-name=\"Include Transcript\"\n    data-type=\"toggle\"\n    data-setting=\"includeTranscript\"\n  ></div>\n  <div class=\"setting-component\"\n    data-name=\"Recording File Path\"\n    data-type=\"text\"\n    data-setting=\"recordingFilePath\"\n    data-description='Specify the file path where recordings will be saved. Ex. If you want to put recordings in Resources folder then path is \"Resources\" (Defaults to root)'\n    data-placeholder=\"Ex. Resources\"\n  ></div>\n</div>"
}